[
  {
    "Id": 1,
    "Title": "Infosys posts biggest fall since Covid selloff, leads plunge in IT counters",
    "Content": "Mumbai: Infosys plunged 9.40% in Monday's trading - its biggest single-day drop in three years - after weaker-than-expected March quarter earnings coupled with a cautious outlook prompted investors to dump technology stocks.The NSE IT index dropped 4.7% to its lowest in two years, while the Nifty fell 0.7%. Analysts are recommending investors to postpone purchases of large-cap IT stocks such as Infosys and TCS, whose valuations are still not considered cheap."
  },
  {
    "Id": 2,
    "Title": "Tyre industry foresees a loss of about Rs 5000 crore in six months to July",
    "Content": "KOCHI: With Covid-19 bringing the production to a halt, the tyre industry is expecting a loss of Rs 4500 to 5000 crore for six months from February to July. All tyre manufacturing facilities have stopped functioning and the industry now expects to resume operations only by mid-April. We have estimated the loss assuming things will get better from August,’’ said Rajiv Budhraja, director general of Automotive Tyre Manufacturer’s Association"
  },
  {
    "Id": 3,
    "Title": "Inflation is the biggest threat today and central banks have to do a little more to bring it down: Bill Winters, Standard Chartered",
    "Content": "Inflation can remain a problem for central banks a lot longer than what the markets are factoring in and even if a recession happens, rates won't go back to zero, says Standard Chartered group chief executive Bill Winters. That the financial markets haven't seen many accidents despite the bond bubble burst is a reflection of the strength of the banking system, though non-banks can be vulnerable, he tells MC Govardhana Rangan, Bodhisatva Ganguli and Joel Rebello."
  },
  {
    "Id": 4,
    "Title": "tata steel posts 2224 cr loss",
    "Content": "Tata Steel Ltd posted a net loss of ₹2,223.84 crore at the consolidated level in the December quarter, primarily due to a sharp drop in realizations and spreads in Europe. It missed the consensus analysts' estimates of ₹1,699.10 crore. Its European operations remained under pressure amid the steep rise in energy costs that affected demand as well as profitability for steel producers. Rising interest rates led to recession fears, following a further slowdown in the European economies."
  },
  {
    "Id": 5,
    "Title": "Maruti Suzuki India posts 9 pc decline in wholesales at 1,39,347 units in Dec",
    "Content": "Maruti Suzuki India Ltd on Sunday reported a 9 per cent decline in total wholesales at 1,39,347 units in December 2022 compared to the year-ago month. The company had clocked a total sales of 1,53,149 units in the same month in 2021, Maruti Suzuki India (MSIL) said in a statement. Total domestic wholesales were at 1,13,535 units last month as against 1,26,031 units in December 2021, down 9.91 per cent, it added."
  }
]